lvx/base/InformationRegisters/бит_НастройкиДоступностиЭлементов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_НастройкиДоступностиЭлементов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УбратьВидимость</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТолькоПросмотр</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Обязательное</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеБлокироватьСостояниемДокумента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяРеквизита</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидЭлемента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыЭлементовУправления</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектСистемы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ОбъектыСистемы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПроизвольноеУсловие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПользовательскиеУсловия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатусыОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяЭлементаУправления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

lvx/base/Enums/бит_ВидыЭлементовУправления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ВидыЭлементовУправления</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВсяФорма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГруппаФормы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолеФормы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТаблицаФормы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КнопкаФормы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДекорацияФормы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоманднаяПанель</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

lvx/base/InformationRegisters/бит_НастройкиДоступностиЭлементов/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбъектыНастройки = бит_НастройкиДоступностиЭлементовФорм.ОбъектыНастройкиДоступностиЭлементов();
	Элементы.ОбъектСистемы.СписокВыбора.ЗагрузитьЗначения(ОбъектыНастройки.ВыгрузитьЗначения());
	
	Если ЗначениеЗаполнено(Параметры.ОбъектСистемы) Тогда
		Запись.ОбъектСистемы = Параметры.ОбъектСистемы;
	КонецЕсли;
	Если ЗначениеЗаполнено(Параметры.Пользователь) Тогда
		Запись.Пользователь = Параметры.Пользователь;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Параметры.Ключ) Тогда
		УправлениеДоступностьюЭлементов();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	УправлениеДоступностьюЭлементов();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// АПК:445-выкл. Строковый параметр
	ТекущийОбъект.УбратьВидимость = (НастройкаОграничения = "УбратьВидимость");
	ТекущийОбъект.ТолькоПросмотр  = (НастройкаОграничения = "ТолькоПросмотр");
	ТекущийОбъект.Обязательное    = (НастройкаОграничения = "Обязательное");
	// АПК:445-вкл. Строковый параметр.
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОбъектСистемыПриИзменении(Элемент)
	
	Запись.ИмяЭлементаУправления = Неопределено;
	Запись.ВидЭлемента           = Неопределено;
	Запись.ИмяРеквизита          = Неопределено;
	
	ПриИзмененииПараметровОбъектаНастройки();
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяЭлементаУправленияПриИзменении(Элемент)
	
	Если ПустаяСтрока(Запись.ИмяЭлементаУправления) Тогда
		Запись.ВидЭлемента           = Неопределено;
		Запись.ИмяРеквизита          = Неопределено;
	КонецЕсли;
	ПриИзмененииПараметровОбъектаНастройки();
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяЭлементаУправленияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОбъектСистемы = Запись.ОбъектСистемы;
	Если Не ЗначениеЗаполнено(ОбъектСистемы) Тогда
		Возврат;
	КонецЕсли;
	                             
	// Откроем форму выбора элемента управления.
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ОбъектСистемы",       ОбъектСистемы);
	ПараметрыФормы.Вставить("ИмяТекущегоЭлемента", Запись.ИмяЭлементаУправления);
	
	ОткрытьФорму("РегистрСведений.бит_НастройкиДоступностиЭлементов.Форма.ВыборЭлементаУправления",
					ПараметрыФормы, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяЭлементаУправленияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		СтандартнаяОбработка = Ложь;
		
		Запись.ИмяЭлементаУправления = ВыбранноеЗначение.ИмяЭлемента;
		Запись.ИмяРеквизита          = ВыбранноеЗначение.ИмяРеквизита;
		Запись.ВидЭлемента           = ВыбранноеЗначение.ВидЭлемента;
	КонецЕсли;
	
	ПриИзмененииПараметровОбъектаНастройки();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидЭлементаПриИзменении(Элемент)
	
	ПриИзмененииПараметровОбъектаНастройки();
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяРеквизитаПриИзменении(Элемент)
	
	ПриИзмененииПараметровОбъектаНастройки();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроизвольноеУсловиеНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор",         ОтборПользовательскихУсловий());
	ПараметрыФормы.Вставить("ТекущаяСтрока", Запись.ПроизвольноеУсловие);
	ПараметрыФормы.Вставить("ОбъектСистемы", Запись.ОбъектСистемы);
	
	ОткрытьФорму("Справочник.бит_ПользовательскиеУсловия.ФормаВыбора", ПараметрыФормы, Элемент);	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеДоступностьюЭлементов()
	
	Элементы.НеБлокироватьСостояниемДокумента.Видимость = ЭлементБлокируетсяСостояниемДокумента();
	
	УстановитьНастройкуОграничений();
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииПараметровОбъектаНастройки()
	
	Запись.НеБлокироватьСостояниемДокумента = Ложь;
	УправлениеДоступностьюЭлементов();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьНастройкуОграничений()
	
	ТекущаяНастройка = "НеИспользуется";
	ДоступныеНастройки = Элементы.НастройкаОграничения.СписокВыбора;
	ДоступныеНастройки.Очистить();
	ДоступныеНастройки.Добавить(ТекущаяНастройка, НСтр("ru='Не используется';
												  		|en='Disable'"));
	НастройкаОграничения = ТекущаяНастройка;
	
	Если ПустаяСтрока(Запись.ИмяЭлементаУправления) Тогда
		Возврат;
	КонецЕсли;
		
	Если Запись.ВидЭлемента <> Перечисления.бит_ВидыЭлементовУправления.ВсяФорма Тогда
		ТекущаяНастройка = "УбратьВидимость";
		ДоступныеНастройки.Добавить(ТекущаяНастройка, НСтр("ru='Скрыть видимость';
													  		|en='Hide'"));
		Если Запись.УбратьВидимость Тогда
			НастройкаОграничения = ТекущаяНастройка;
		КонецЕсли;
	КонецЕсли;
	Если Запись.ВидЭлемента <> Перечисления.бит_ВидыЭлементовУправления.ГруппаФормы
		И Запись.ВидЭлемента <> Перечисления.бит_ВидыЭлементовУправления.ДекорацияФормы Тогда
		ТекущаяНастройка = "ТолькоПросмотр";
		ДоступныеНастройки.Добавить(ТекущаяНастройка, НСтр("ru='Только просмотр';
													  		|en='Read only'"));
		Если Запись.ТолькоПросмотр Тогда
			НастройкаОграничения = ТекущаяНастройка;
		КонецЕсли;
	КонецЕсли;
	Если ВозможнаПроверкаЗаполненияПоля() Тогда
		ТекущаяНастройка = "Обязательное";
		ДоступныеНастройки.Добавить(ТекущаяНастройка, НСтр("ru='Обязательное';
													  	|en='Required to fill'"));
		Если Запись.Обязательное Тогда
			НастройкаОграничения = ТекущаяНастройка;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ВозможнаПроверкаЗаполненияПоля()
	
	ИмяРеквизита = Запись.ИмяРеквизита;
	
	Если ПустаяСтрока(ИмяРеквизита) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Запись.ОбъектСистемы.Пустая() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Запись.ВидЭлемента = Перечисления.бит_ВидыЭлементовУправления.ТаблицаФормы Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ОбъектМетаданных = Справочники.бит_ОбъектыСистемы.ОбъектМетаданныхПоОбъектуСистемы(Запись.ОбъектСистемы);
	Если ОбъектМетаданных = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ПроверяемыйОбъект   = ОбъектМетаданных;
	ПроверяемыйРеквизит = ИмяРеквизита;
	
	ПутьКРеквизиту = СтрРазделить(ИмяРеквизита, ".");
	Если ПутьКРеквизиту.Количество() = 2 Тогда
		// Возможно реквизит табличной части.
		ИмяТабличнойЧасти   = ПутьКРеквизиту[0];
		ПроверяемыйРеквизит = ПутьКРеквизиту[1];
		Если ОбъектМетаданных.ТабличныеЧасти.Найти(ИмяТабличнойЧасти) = Неопределено Тогда
			Возврат Ложь;
		КонецЕсли;
		
		ПроверяемыйОбъект = ОбъектМетаданных.ТабличныеЧасти[ИмяТабличнойЧасти];
	КонецЕсли;
	
	Реквизит = Неопределено;
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта(ПроверяемыйРеквизит, ПроверяемыйОбъект) Тогда
		Реквизит = ПроверяемыйОбъект.Реквизиты[ПроверяемыйРеквизит];
	ИначеЕсли ОбщегоНазначения.ЭтоСтандартныйРеквизит(ПроверяемыйОбъект.СтандартныеРеквизиты, ПроверяемыйРеквизит) Тогда
		Реквизит = ПроверяемыйОбъект.СтандартныеРеквизиты[ПроверяемыйРеквизит];
	КонецЕсли;
	
	Если Реквизит = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Реквизит.Тип = Новый ОписаниеТипов("Булево") Тогда
		Возврат Ложь;
	КонецЕсли;
		
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция ЭлементБлокируетсяСостояниемДокумента()
	
	Если ПустаяСтрока(Запись.ИмяЭлементаУправления) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ОбъектСистемы = Запись.ОбъектСистемы;
	Если Не ЗначениеЗаполнено(ОбъектСистемы) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ЭлементыИсключения = бит_НастройкиДоступностиЭлементовФорм.ЭлементыИсключенияНастройкиДоступности(ОбъектСистемы);
	Если ЭлементыИсключения.НайтиПоЗначению(Запись.ИмяЭлементаУправления) <> Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Запись.ВидЭлемента = Перечисления.бит_ВидыЭлементовУправления.ВсяФорма Тогда
		Элементы.НеБлокироватьСостояниемДокумента.Подсказка =
			НСтр("ru='Отключить блокировку изменения документа статусом.';
				|en='Disable blocking document changes by status.'");
	Иначе
		Элементы.НеБлокироватьСостояниемДокумента.Подсказка =
			НСтр("ru='Включить возможность изменения элемента управления в документах со статусом выше Черновика.';
				|en='Enable the ability to change field in documents with a status higher than Draft.'");
	КонецЕсли;
	
	Если Запись.ВидЭлемента = Перечисления.бит_ВидыЭлементовУправления.ВсяФорма
		Или Запись.ВидЭлемента = Перечисления.бит_ВидыЭлементовУправления.ПолеФормы
		Или Запись.ВидЭлемента = Перечисления.бит_ВидыЭлементовУправления.ТаблицаФормы
		Или Запись.ВидЭлемента = Перечисления.бит_ВидыЭлементовУправления.КнопкаФормы Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

&НаКлиенте
Функция ОтборПользовательскихУсловий()
	
	Отбор = Новый Структура;

	КонтекстВыполнения = Новый СписокЗначений;
	КонтекстВыполнения.Добавить(
		ПредопределенноеЗначение("Перечисление.бит_КонтекстыВыполненияПользовательскихУсловий.ТекущийОбъект"));
	КонтекстВыполнения.Добавить(
		ПредопределенноеЗначение("Перечисление.бит_КонтекстыВыполненияПользовательскихУсловий.ТекущийОбъект_УстановленныеВизы"));
	Отбор.Вставить("КонтекстВыполнения", КонтекстВыполнения);
	
	Возврат Отбор;
	
КонецФункции

#КонецОбласти
